Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cvd.h
/*
 * Component description for CVD
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_CVD_COMPONENT_H_
#define _PIC32WM_BZ6_CVD_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR CVD                       */
/* ************************************************************************** */

/* -------- CVD_CVDCON : (CVD Offset: 0x00) (R/W 32) CVD Control Register -------- */
#define CVD_CVDCON_RESETVALUE                 _UINT32_(0x20000)                                    /*  (CVD_CVDCON) CVD Control Register  Reset Value */

#define CVD_CVDCON_TRIGSEL_Pos                _UINT32_(0)                                          /* (CVD_CVDCON) Selects one of 15 external trigger inputs to start scanning. Position */
#define CVD_CVDCON_TRIGSEL_Msk                (_UINT32_(0xF) << CVD_CVDCON_TRIGSEL_Pos)            /* (CVD_CVDCON) Selects one of 15 external trigger inputs to start scanning. Mask */
#define CVD_CVDCON_TRIGSEL(value)             (CVD_CVDCON_TRIGSEL_Msk & (_UINT32_(value) << CVD_CVDCON_TRIGSEL_Pos)) /* Assignment of value for TRIGSEL in the CVD_CVDCON register */
#define CVD_CVDCON_CLKSEL_Pos                 _UINT32_(4)                                          /* (CVD_CVDCON) Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3 Position */
#define CVD_CVDCON_CLKSEL_Msk                 (_UINT32_(0x3) << CVD_CVDCON_CLKSEL_Pos)             /* (CVD_CVDCON) Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3 Mask */
#define CVD_CVDCON_CLKSEL(value)              (CVD_CVDCON_CLKSEL_Msk & (_UINT32_(value) << CVD_CVDCON_CLKSEL_Pos)) /* Assignment of value for CLKSEL in the CVD_CVDCON register */
#define CVD_CVDCON_FIFOTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDCON) Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion Position */
#define CVD_CVDCON_FIFOTH_Msk                 (_UINT32_(0x3FF) << CVD_CVDCON_FIFOTH_Pos)           /* (CVD_CVDCON) Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion Mask */
#define CVD_CVDCON_FIFOTH(value)              (CVD_CVDCON_FIFOTH_Msk & (_UINT32_(value) << CVD_CVDCON_FIFOTH_Pos)) /* Assignment of value for FIFOTH in the CVD_CVDCON register */
#define CVD_CVDCON_FIFOTHIEN_Pos              _UINT32_(18)                                         /* (CVD_CVDCON) FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met Position */
#define CVD_CVDCON_FIFOTHIEN_Msk              (_UINT32_(0x1) << CVD_CVDCON_FIFOTHIEN_Pos)          /* (CVD_CVDCON) FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met Mask */
#define CVD_CVDCON_FIFOTHIEN(value)           (CVD_CVDCON_FIFOTHIEN_Msk & (_UINT32_(value) << CVD_CVDCON_FIFOTHIEN_Pos)) /* Assignment of value for FIFOTHIEN in the CVD_CVDCON register */
#define CVD_CVDCON_CVDIEN_Pos                 _UINT32_(19)                                         /* (CVD_CVDCON) Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts. Position */
#define CVD_CVDCON_CVDIEN_Msk                 (_UINT32_(0x1) << CVD_CVDCON_CVDIEN_Pos)             /* (CVD_CVDCON) Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts. Mask */
#define CVD_CVDCON_CVDIEN(value)              (CVD_CVDCON_CVDIEN_Msk & (_UINT32_(value) << CVD_CVDCON_CVDIEN_Pos)) /* Assignment of value for CVDIEN in the CVD_CVDCON register */
#define CVD_CVDCON_THSTR_Pos                  _UINT32_(23)                                         /* (CVD_CVDCON) Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO Position */
#define CVD_CVDCON_THSTR_Msk                  (_UINT32_(0x1) << CVD_CVDCON_THSTR_Pos)              /* (CVD_CVDCON) Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO Mask */
#define CVD_CVDCON_THSTR(value)               (CVD_CVDCON_THSTR_Msk & (_UINT32_(value) << CVD_CVDCON_THSTR_Pos)) /* Assignment of value for THSTR in the CVD_CVDCON register */
#define CVD_CVDCON_SWTRIG_Pos                 _UINT32_(24)                                         /* (CVD_CVDCON) Software Trigger control. Starts scan manuallyCleared by Hardware. Position */
#define CVD_CVDCON_SWTRIG_Msk                 (_UINT32_(0x1) << CVD_CVDCON_SWTRIG_Pos)             /* (CVD_CVDCON) Software Trigger control. Starts scan manuallyCleared by Hardware. Mask */
#define CVD_CVDCON_SWTRIG(value)              (CVD_CVDCON_SWTRIG_Msk & (_UINT32_(value) << CVD_CVDCON_SWTRIG_Pos)) /* Assignment of value for SWTRIG in the CVD_CVDCON register */
#define CVD_CVDCON_ABORT_Pos                  _UINT32_(25)                                         /* (CVD_CVDCON) Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware Position */
#define CVD_CVDCON_ABORT_Msk                  (_UINT32_(0x1) << CVD_CVDCON_ABORT_Pos)              /* (CVD_CVDCON) Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware Mask */
#define CVD_CVDCON_ABORT(value)               (CVD_CVDCON_ABORT_Msk & (_UINT32_(value) << CVD_CVDCON_ABORT_Pos)) /* Assignment of value for ABORT in the CVD_CVDCON register */
#define CVD_CVDCON_SDWREN_Pos                 _UINT32_(27)                                         /* (CVD_CVDCON) Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain. Position */
#define CVD_CVDCON_SDWREN_Msk                 (_UINT32_(0x1) << CVD_CVDCON_SDWREN_Pos)             /* (CVD_CVDCON) Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain. Mask */
#define CVD_CVDCON_SDWREN(value)              (CVD_CVDCON_SDWREN_Msk & (_UINT32_(value) << CVD_CVDCON_SDWREN_Pos)) /* Assignment of value for SDWREN in the CVD_CVDCON register */
#define CVD_CVDCON_ORDER_Pos                  _UINT32_(28)                                         /* (CVD_CVDCON) RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue Position */
#define CVD_CVDCON_ORDER_Msk                  (_UINT32_(0x1) << CVD_CVDCON_ORDER_Pos)              /* (CVD_CVDCON) RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue Mask */
#define CVD_CVDCON_ORDER(value)               (CVD_CVDCON_ORDER_Msk & (_UINT32_(value) << CVD_CVDCON_ORDER_Pos)) /* Assignment of value for ORDER in the CVD_CVDCON register */
#define CVD_CVDCON_SIDL_Pos                   _UINT32_(29)                                         /* (CVD_CVDCON) Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode Position */
#define CVD_CVDCON_SIDL_Msk                   (_UINT32_(0x1) << CVD_CVDCON_SIDL_Pos)               /* (CVD_CVDCON) Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode Mask */
#define CVD_CVDCON_SIDL(value)                (CVD_CVDCON_SIDL_Msk & (_UINT32_(value) << CVD_CVDCON_SIDL_Pos)) /* Assignment of value for SIDL in the CVD_CVDCON register */
#define CVD_CVDCON_FRZ_Pos                    _UINT32_(30)                                         /* (CVD_CVDCON) Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode Position */
#define CVD_CVDCON_FRZ_Msk                    (_UINT32_(0x1) << CVD_CVDCON_FRZ_Pos)                /* (CVD_CVDCON) Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode Mask */
#define CVD_CVDCON_FRZ(value)                 (CVD_CVDCON_FRZ_Msk & (_UINT32_(value) << CVD_CVDCON_FRZ_Pos)) /* Assignment of value for FRZ in the CVD_CVDCON register */
#define CVD_CVDCON_ON_Pos                     _UINT32_(31)                                         /* (CVD_CVDCON) Enables the State Machine to scan enabled Scan Descriptors upon next trigger. Position */
#define CVD_CVDCON_ON_Msk                     (_UINT32_(0x1) << CVD_CVDCON_ON_Pos)                 /* (CVD_CVDCON) Enables the State Machine to scan enabled Scan Descriptors upon next trigger. Mask */
#define CVD_CVDCON_ON(value)                  (CVD_CVDCON_ON_Msk & (_UINT32_(value) << CVD_CVDCON_ON_Pos)) /* Assignment of value for ON in the CVD_CVDCON register */
#define CVD_CVDCON_Msk                        _UINT32_(0xFB8FFF3F)                                 /* (CVD_CVDCON) Register Mask  */


/* -------- CVD_CVDADC : (CVD Offset: 0x04) (R/W 32) CVD ADC Configuration Register -------- */
#define CVD_CVDADC_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDADC) CVD ADC Configuration Register  Reset Value */

#define CVD_CVDADC_CVDCPL_Pos                 _UINT32_(0)                                          /* (CVD_CVDADC) Capacitor Party Line Position */
#define CVD_CVDADC_CVDCPL_Msk                 (_UINT32_(0x7) << CVD_CVDADC_CVDCPL_Pos)             /* (CVD_CVDADC) Capacitor Party Line Mask */
#define CVD_CVDADC_CVDCPL(value)              (CVD_CVDADC_CVDCPL_Msk & (_UINT32_(value) << CVD_CVDADC_CVDCPL_Pos)) /* Assignment of value for CVDCPL in the CVD_CVDADC register */
#define CVD_CVDADC_CVDEN_Pos                  _UINT32_(3)                                          /* (CVD_CVDADC) Enable CVD Position */
#define CVD_CVDADC_CVDEN_Msk                  (_UINT32_(0x1) << CVD_CVDADC_CVDEN_Pos)              /* (CVD_CVDADC) Enable CVD Mask */
#define CVD_CVDADC_CVDEN(value)               (CVD_CVDADC_CVDEN_Msk & (_UINT32_(value) << CVD_CVDADC_CVDEN_Pos)) /* Assignment of value for CVDEN in the CVD_CVDADC register */
#define CVD_CVDADC_SELRES_Pos                 _UINT32_(8)                                          /* (CVD_CVDADC) Shared sarcore resolution select Position */
#define CVD_CVDADC_SELRES_Msk                 (_UINT32_(0x3) << CVD_CVDADC_SELRES_Pos)             /* (CVD_CVDADC) Shared sarcore resolution select Mask */
#define CVD_CVDADC_SELRES(value)              (CVD_CVDADC_SELRES_Msk & (_UINT32_(value) << CVD_CVDADC_SELRES_Pos)) /* Assignment of value for SELRES in the CVD_CVDADC register */
#define CVD_CVDADC_DIFFPEN_Pos                _UINT32_(10)                                         /* (CVD_CVDADC) Shared sarcore differential enabled Position */
#define CVD_CVDADC_DIFFPEN_Msk                (_UINT32_(0x1) << CVD_CVDADC_DIFFPEN_Pos)            /* (CVD_CVDADC) Shared sarcore differential enabled Mask */
#define CVD_CVDADC_DIFFPEN(value)             (CVD_CVDADC_DIFFPEN_Msk & (_UINT32_(value) << CVD_CVDADC_DIFFPEN_Pos)) /* Assignment of value for DIFFPEN in the CVD_CVDADC register */
#define CVD_CVDADC_ANN1EN_Pos                 _UINT32_(11)                                         /* (CVD_CVDADC) ANN1 channel enabled Position */
#define CVD_CVDADC_ANN1EN_Msk                 (_UINT32_(0x1) << CVD_CVDADC_ANN1EN_Pos)             /* (CVD_CVDADC) ANN1 channel enabled Mask */
#define CVD_CVDADC_ANN1EN(value)              (CVD_CVDADC_ANN1EN_Msk & (_UINT32_(value) << CVD_CVDADC_ANN1EN_Pos)) /* Assignment of value for ANN1EN in the CVD_CVDADC register */
#define CVD_CVDADC_Msk                        _UINT32_(0x00000F0F)                                 /* (CVD_CVDADC) Register Mask  */


/* -------- CVD_CVDSTAT : (CVD Offset: 0x08) (R/W 32) CVD Status Register -------- */
#define CVD_CVDSTAT_RESETVALUE                _UINT32_(0x20000000)                                 /*  (CVD_CVDSTAT) CVD Status Register  Reset Value */

#define CVD_CVDSTAT_SD1BUSY_Pos               _UINT32_(0)                                          /* (CVD_CVDSTAT) Scan Descriptor 1 is in progress Position */
#define CVD_CVDSTAT_SD1BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD1BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 1 is in progress Mask */
#define CVD_CVDSTAT_SD1BUSY(value)            (CVD_CVDSTAT_SD1BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1BUSY_Pos)) /* Assignment of value for SD1BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD1DONE_Pos               _UINT32_(1)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1. Position */
#define CVD_CVDSTAT_SD1DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD1DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1. Mask */
#define CVD_CVDSTAT_SD1DONE(value)            (CVD_CVDSTAT_SD1DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1DONE_Pos)) /* Assignment of value for SD1DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD1INT_Pos                _UINT32_(2)                                          /* (CVD_CVDSTAT) Scan Descriptor 1 has caused an interrupt Position */
#define CVD_CVDSTAT_SD1INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD1INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 1 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD1INT(value)             (CVD_CVDSTAT_SD1INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1INT_Pos)) /* Assignment of value for SD1INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2BUSY_Pos               _UINT32_(4)                                          /* (CVD_CVDSTAT) Scan Descriptor 2 is in progress Position */
#define CVD_CVDSTAT_SD2BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD2BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 2 is in progress Mask */
#define CVD_CVDSTAT_SD2BUSY(value)            (CVD_CVDSTAT_SD2BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2BUSY_Pos)) /* Assignment of value for SD2BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2DONE_Pos               _UINT32_(5)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2. Position */
#define CVD_CVDSTAT_SD2DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD2DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2. Mask */
#define CVD_CVDSTAT_SD2DONE(value)            (CVD_CVDSTAT_SD2DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2DONE_Pos)) /* Assignment of value for SD2DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2INT_Pos                _UINT32_(6)                                          /* (CVD_CVDSTAT) Scan Descriptor 2 has caused an interrupt Position */
#define CVD_CVDSTAT_SD2INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD2INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 2 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD2INT(value)             (CVD_CVDSTAT_SD2INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2INT_Pos)) /* Assignment of value for SD2INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3BUSY_Pos               _UINT32_(8)                                          /* (CVD_CVDSTAT) Scan Descriptor 3 is in progress Position */
#define CVD_CVDSTAT_SD3BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD3BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 3 is in progress Mask */
#define CVD_CVDSTAT_SD3BUSY(value)            (CVD_CVDSTAT_SD3BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3BUSY_Pos)) /* Assignment of value for SD3BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3DONE_Pos               _UINT32_(9)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3. Position */
#define CVD_CVDSTAT_SD3DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD3DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3. Mask */
#define CVD_CVDSTAT_SD3DONE(value)            (CVD_CVDSTAT_SD3DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3DONE_Pos)) /* Assignment of value for SD3DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3INT_Pos                _UINT32_(10)                                         /* (CVD_CVDSTAT) Scan Descriptor 3 has caused an interrupt Position */
#define CVD_CVDSTAT_SD3INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD3INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 3 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD3INT(value)             (CVD_CVDSTAT_SD3INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3INT_Pos)) /* Assignment of value for SD3INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4BUSY_Pos               _UINT32_(12)                                         /* (CVD_CVDSTAT) Scan Descriptor 4 is in progress Position */
#define CVD_CVDSTAT_SD4BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD4BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 4 is in progress Mask */
#define CVD_CVDSTAT_SD4BUSY(value)            (CVD_CVDSTAT_SD4BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4BUSY_Pos)) /* Assignment of value for SD4BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4DONE_Pos               _UINT32_(13)                                         /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4. Position */
#define CVD_CVDSTAT_SD4DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD4DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4. Mask */
#define CVD_CVDSTAT_SD4DONE(value)            (CVD_CVDSTAT_SD4DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4DONE_Pos)) /* Assignment of value for SD4DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4INT_Pos                _UINT32_(14)                                         /* (CVD_CVDSTAT) Scan Descriptor 4 has caused an interrupt. Position */
#define CVD_CVDSTAT_SD4INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD4INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 4 has caused an interrupt. Mask */
#define CVD_CVDSTAT_SD4INT(value)             (CVD_CVDSTAT_SD4INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4INT_Pos)) /* Assignment of value for SD4INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOCNT_Pos               _UINT32_(16)                                         /* (CVD_CVDSTAT) Results FIFO word count: Indicates the number of words in the Results FIFO. Position */
#define CVD_CVDSTAT_FIFOCNT_Msk               (_UINT32_(0x3FF) << CVD_CVDSTAT_FIFOCNT_Pos)         /* (CVD_CVDSTAT) Results FIFO word count: Indicates the number of words in the Results FIFO. Mask */
#define CVD_CVDSTAT_FIFOCNT(value)            (CVD_CVDSTAT_FIFOCNT_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOCNT_Pos)) /* Assignment of value for FIFOCNT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOMT_Pos                _UINT32_(29)                                         /* (CVD_CVDSTAT) The Results FIFO is empty. Position */
#define CVD_CVDSTAT_FIFOMT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_FIFOMT_Pos)            /* (CVD_CVDSTAT) The Results FIFO is empty. Mask */
#define CVD_CVDSTAT_FIFOMT(value)             (CVD_CVDSTAT_FIFOMT_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOMT_Pos)) /* Assignment of value for FIFOMT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOWM_Pos                _UINT32_(30)                                         /* (CVD_CVDSTAT) The Results FIFO has reached the programmed FIFOTHRESH threshold. Position */
#define CVD_CVDSTAT_FIFOWM_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_FIFOWM_Pos)            /* (CVD_CVDSTAT) The Results FIFO has reached the programmed FIFOTHRESH threshold. Mask */
#define CVD_CVDSTAT_FIFOWM(value)             (CVD_CVDSTAT_FIFOWM_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOWM_Pos)) /* Assignment of value for FIFOWM in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOFULL_Pos              _UINT32_(31)                                         /* (CVD_CVDSTAT) The Results FIFO is full. Position */
#define CVD_CVDSTAT_FIFOFULL_Msk              (_UINT32_(0x1) << CVD_CVDSTAT_FIFOFULL_Pos)          /* (CVD_CVDSTAT) The Results FIFO is full. Mask */
#define CVD_CVDSTAT_FIFOFULL(value)           (CVD_CVDSTAT_FIFOFULL_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOFULL_Pos)) /* Assignment of value for FIFOFULL in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_Msk                       _UINT32_(0xE3FF7777)                                 /* (CVD_CVDSTAT) Register Mask  */


/* -------- CVD_CVDRESH : (CVD Offset: 0x10) ( R/ 32) CVD RESULTS POS FIFO Read Register (CVDRESH) -------- */
#define CVD_CVDRESH_RESETVALUE                _UINT32_(0x00)                                       /*  (CVD_CVDRESH) CVD RESULTS POS FIFO Read Register (CVDRESH)  Reset Value */

