Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cvd.h
#define CVD_CVDSD3C1_SDOVRSAMP_Pos            _UINT32_(0)                                          /* (CVD_CVDSD3C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Position */
#define CVD_CVDSD3C1_SDOVRSAMP_Msk            (_UINT32_(0x7F) << CVD_CVDSD3C1_SDOVRSAMP_Pos)       /* (CVD_CVDSD3C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Mask */
#define CVD_CVDSD3C1_SDOVRSAMP(value)         (CVD_CVDSD3C1_SDOVRSAMP_Msk & (_UINT32_(value) << CVD_CVDSD3C1_SDOVRSAMP_Pos)) /* Assignment of value for SDOVRSAMP in the CVD_CVDSD3C1 register */
#define CVD_CVDSD3C1_SDTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDSD3C1) Scan Descriptor Threshold. Position */
#define CVD_CVDSD3C1_SDTH_Msk                 (_UINT32_(0xFFFFFF) << CVD_CVDSD3C1_SDTH_Pos)        /* (CVD_CVDSD3C1) Scan Descriptor Threshold. Mask */
#define CVD_CVDSD3C1_SDTH(value)              (CVD_CVDSD3C1_SDTH_Msk & (_UINT32_(value) << CVD_CVDSD3C1_SDTH_Pos)) /* Assignment of value for SDTH in the CVD_CVDSD3C1 register */
#define CVD_CVDSD3C1_Msk                      _UINT32_(0xFFFFFF7F)                                 /* (CVD_CVDSD3C1) Register Mask  */


/* -------- CVD_CVDSD3C2 : (CVD Offset: 0x134) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER -------- */
#define CVD_CVDSD3C2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD3C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER  Reset Value */

#define CVD_CVDSD3C2_SDRXBEG_Pos              _UINT32_(0)                                          /* (CVD_CVDSD3C2) Scan Descriptor RX Index StartDetermines the first RX index to include in a scan. Position */
#define CVD_CVDSD3C2_SDRXBEG_Msk              (_UINT32_(0x3F) << CVD_CVDSD3C2_SDRXBEG_Pos)         /* (CVD_CVDSD3C2) Scan Descriptor RX Index StartDetermines the first RX index to include in a scan. Mask */
#define CVD_CVDSD3C2_SDRXBEG(value)           (CVD_CVDSD3C2_SDRXBEG_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDRXBEG_Pos)) /* Assignment of value for SDRXBEG in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDRXSTRIDE0_Pos          _UINT32_(6)                                          /* (CVD_CVDSD3C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Position */
#define CVD_CVDSD3C2_SDRXSTRIDE0_Msk          (_UINT32_(0x3) << CVD_CVDSD3C2_SDRXSTRIDE0_Pos)      /* (CVD_CVDSD3C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Mask */
#define CVD_CVDSD3C2_SDRXSTRIDE0(value)       (CVD_CVDSD3C2_SDRXSTRIDE0_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDRXSTRIDE0_Pos)) /* Assignment of value for SDRXSTRIDE0 in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDRXEND_Pos              _UINT32_(8)                                          /* (CVD_CVDSD3C2) Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete. Position */
#define CVD_CVDSD3C2_SDRXEND_Msk              (_UINT32_(0x3F) << CVD_CVDSD3C2_SDRXEND_Pos)         /* (CVD_CVDSD3C2) Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete. Mask */
#define CVD_CVDSD3C2_SDRXEND(value)           (CVD_CVDSD3C2_SDRXEND_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDRXEND_Pos)) /* Assignment of value for SDRXEND in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDRXSTRIDE1_Pos          _UINT32_(14)                                         /* (CVD_CVDSD3C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Position */
#define CVD_CVDSD3C2_SDRXSTRIDE1_Msk          (_UINT32_(0x3) << CVD_CVDSD3C2_SDRXSTRIDE1_Pos)      /* (CVD_CVDSD3C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Mask */
#define CVD_CVDSD3C2_SDRXSTRIDE1(value)       (CVD_CVDSD3C2_SDRXSTRIDE1_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDRXSTRIDE1_Pos)) /* Assignment of value for SDRXSTRIDE1 in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDTXBEG_Pos              _UINT32_(16)                                         /* (CVD_CVDSD3C2) Scan Descriptor TX Index StartDetermines the first TX index to include in a scan. Position */
#define CVD_CVDSD3C2_SDTXBEG_Msk              (_UINT32_(0x3F) << CVD_CVDSD3C2_SDTXBEG_Pos)         /* (CVD_CVDSD3C2) Scan Descriptor TX Index StartDetermines the first TX index to include in a scan. Mask */
#define CVD_CVDSD3C2_SDTXBEG(value)           (CVD_CVDSD3C2_SDTXBEG_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDTXBEG_Pos)) /* Assignment of value for SDTXBEG in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDTXSTRIDE0_Pos          _UINT32_(22)                                         /* (CVD_CVDSD3C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Position */
#define CVD_CVDSD3C2_SDTXSTRIDE0_Msk          (_UINT32_(0x3) << CVD_CVDSD3C2_SDTXSTRIDE0_Pos)      /* (CVD_CVDSD3C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Mask */
#define CVD_CVDSD3C2_SDTXSTRIDE0(value)       (CVD_CVDSD3C2_SDTXSTRIDE0_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDTXSTRIDE0_Pos)) /* Assignment of value for SDTXSTRIDE0 in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDTXEND_Pos              _UINT32_(24)                                         /* (CVD_CVDSD3C2) Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete. Position */
#define CVD_CVDSD3C2_SDTXEND_Msk              (_UINT32_(0x3F) << CVD_CVDSD3C2_SDTXEND_Pos)         /* (CVD_CVDSD3C2) Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete. Mask */
#define CVD_CVDSD3C2_SDTXEND(value)           (CVD_CVDSD3C2_SDTXEND_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDTXEND_Pos)) /* Assignment of value for SDTXEND in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_SDTXSTRIDE1_Pos          _UINT32_(30)                                         /* (CVD_CVDSD3C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Position */
#define CVD_CVDSD3C2_SDTXSTRIDE1_Msk          (_UINT32_(0x3) << CVD_CVDSD3C2_SDTXSTRIDE1_Pos)      /* (CVD_CVDSD3C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Mask */
#define CVD_CVDSD3C2_SDTXSTRIDE1(value)       (CVD_CVDSD3C2_SDTXSTRIDE1_Msk & (_UINT32_(value) << CVD_CVDSD3C2_SDTXSTRIDE1_Pos)) /* Assignment of value for SDTXSTRIDE1 in the CVD_CVDSD3C2 register */
#define CVD_CVDSD3C2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CVD_CVDSD3C2) Register Mask  */


